tests/performance/api-load-test.yml
# ============================================
# Sparklio API 부하 테스트 (Artillery)
# ============================================
# 작성일: 2025-11-15
# 목적: Canvas Studio v3 API 응답 시간 측정
# 참고: docs/A_TEAM_QA_WORK_ORDER.md (섹션 8.2)
#
# 실행 방법:
#   artillery run tests/performance/api-load-test.yml --output report.json
#   artillery report report.json
# ============================================

config:
  target: "{{ $processEnvironment.API_BASE_URL || 'http://localhost:8000' }}"
  phases:
    # Phase 1: 워밍업 (10초, 초당 5 요청)
    - duration: 10
      arrivalRate: 5
      name: "Warmup"

    # Phase 2: 정상 부하 (60초, 초당 10 요청)
    - duration: 60
      arrivalRate: 10
      name: "Sustained load"

    # Phase 3: 스파이크 부하 (30초, 초당 50 요청)
    - duration: 30
      arrivalRate: 50
      name: "Spike load"

    # Phase 4: 쿨다운 (10초, 초당 5 요청)
    - duration: 10
      arrivalRate: 5
      name: "Cooldown"

  processor: "./processor.js"

  # 성능 기준 (Thresholds)
  ensure:
    # p95 응답 시간 < 2000ms
    p95: 2000

    # p99 응답 시간 < 3000ms
    p99: 3000

    # 에러율 < 1%
    maxErrorRate: 1

  # 환경 변수
  variables:
    testUserId: "user-test-001"
    testBrandId: "brand-test-001"

# ============================================
# 시나리오 정의
# ============================================

scenarios:
  # ============================================
  # Scenario 1: Document CRUD
  # ============================================
  - name: "Document CRUD Operations"
    weight: 40
    flow:
      # 1. 새 문서 생성
      - post:
          url: "/api/v1/documents"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
            Content-Type: "application/json"
          json:
            name: "Load Test Doc {{ $randomString() }}"
            document_type: "concept_board"
            brand_id: "{{ testBrandId }}"
            document_json:
              version: "1.0"
              mode: "concept_board"
              objects: []
              viewport:
                zoom: 1
                x: 0
                y: 0
          capture:
            - json: "$.id"
              as: "docId"
          expect:
            - statusCode: 201
            - contentType: json
            - hasProperty: id

      # 2. 문서 조회
      - get:
          url: "/api/v1/documents/{{ docId }}"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          expect:
            - statusCode: 200
            - contentType: json

      # 3. 문서 수정
      - patch:
          url: "/api/v1/documents/{{ docId }}"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
            Content-Type: "application/json"
          json:
            document_json:
              version: "1.0"
              mode: "concept_board"
              objects:
                - id: "obj-1"
                  type: "text"
                  text: "Updated"
                  props:
                    fontSize: 32
                    fill: "#FF6B35"
              viewport:
                zoom: 1
                x: 0
                y: 0
          expect:
            - statusCode: 200

      # 4. 문서 목록 조회
      - get:
          url: "/api/v1/documents?brand_id={{ testBrandId }}&limit=20"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          expect:
            - statusCode: 200
            - contentType: json

  # ============================================
  # Scenario 2: Template Operations
  # ============================================
  - name: "Template Operations"
    weight: 20
    flow:
      # 1. Template 목록 조회
      - get:
          url: "/api/v1/templates?mode=concept_board"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          expect:
            - statusCode: 200
            - contentType: json
          capture:
            - json: "$.templates[0].id"
              as: "templateId"

      # 2. Template으로 문서 생성
      - post:
          url: "/api/v1/templates/{{ templateId }}/instantiate"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
            Content-Type: "application/json"
          json:
            document_name: "From Template {{ $randomString() }}"
            brand_id: "{{ testBrandId }}"
          expect:
            - statusCode: 201
            - hasProperty: document_id

  # ============================================
  # Scenario 3: Editor Action API
  # ============================================
  - name: "Editor Action API"
    weight: 30
    flow:
      # 기존 픽스처 문서 사용
      - post:
          url: "/api/v1/editor/action"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
            Content-Type: "application/json"
          json:
            document_id: "doc-pitch-fixture-001"
            action:
              type: "update_font_size"
              target:
                selector: "type:text AND name:Main Title"
              payload:
                fontSize: 48
          expect:
            - statusCode: 200
            - hasProperty: document_json

  # ============================================
  # Scenario 4: Concept Board Tiles
  # ============================================
  - name: "Concept Board Tiles (Mock Provider)"
    weight: 10
    flow:
      # 1. Concept Board 조회
      - get:
          url: "/api/v1/concept-boards/board-fixture-001"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          expect:
            - statusCode: 200

      # 2. Tile 생성 (Mock Provider)
      - post:
          url: "/api/v1/concept-boards/board-fixture-001/tiles"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
            Content-Type: "application/json"
          json:
            prompt: "minimalist office {{ $randomString() }}"
            width: 512
            height: 512
          expect:
            - statusCode: 201
            - hasProperty: id
            - hasProperty: image_url